modm-ext/data.modm.io/docs/svd/header_stm32f358xx.svd
        <register>
          <name>IOASCR</name>
          <description>TSC I/O analog switch control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>G1_IO1</name>
              <description>GROUP1_IO1 analog switch enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO2</name>
              <description>GROUP1_IO2 analog switch enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO3</name>
              <description>GROUP1_IO3 analog switch enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO4</name>
              <description>GROUP1_IO4 analog switch enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO1</name>
              <description>GROUP2_IO1 analog switch enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO2</name>
              <description>GROUP2_IO2 analog switch enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO3</name>
              <description>GROUP2_IO3 analog switch enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO4</name>
              <description>GROUP2_IO4 analog switch enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO1</name>
              <description>GROUP3_IO1 analog switch enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO2</name>
              <description>GROUP3_IO2 analog switch enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO3</name>
              <description>GROUP3_IO3 analog switch enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO4</name>
              <description>GROUP3_IO4 analog switch enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO1</name>
              <description>GROUP4_IO1 analog switch enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO2</name>
              <description>GROUP4_IO2 analog switch enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO3</name>
              <description>GROUP4_IO3 analog switch enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO4</name>
              <description>GROUP4_IO4 analog switch enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO1</name>
              <description>GROUP5_IO1 analog switch enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO2</name>
              <description>GROUP5_IO2 analog switch enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO3</name>
              <description>GROUP5_IO3 analog switch enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO4</name>
              <description>GROUP5_IO4 analog switch enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO1</name>
              <description>GROUP6_IO1 analog switch enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO2</name>
              <description>GROUP6_IO2 analog switch enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO3</name>
              <description>GROUP6_IO3 analog switch enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO4</name>
              <description>GROUP6_IO4 analog switch enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO1</name>
              <description>GROUP7_IO1 analog switch enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO2</name>
              <description>GROUP7_IO2 analog switch enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO3</name>
              <description>GROUP7_IO3 analog switch enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO4</name>
              <description>GROUP7_IO4 analog switch enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO1</name>
              <description>GROUP8_IO1 analog switch enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO2</name>
              <description>GROUP8_IO2 analog switch enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO3</name>
              <description>GROUP8_IO3 analog switch enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO4</name>
              <description>GROUP8_IO4 analog switch enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSCR</name>
          <description>TSC I/O sampling control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>G1_IO1</name>
              <description>GROUP1_IO1 sampling mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO2</name>
              <description>GROUP1_IO2 sampling mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO3</name>
              <description>GROUP1_IO3 sampling mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO4</name>
              <description>GROUP1_IO4 sampling mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO1</name>
              <description>GROUP2_IO1 sampling mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO2</name>
              <description>GROUP2_IO2 sampling mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO3</name>
              <description>GROUP2_IO3 sampling mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO4</name>
              <description>GROUP2_IO4 sampling mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO1</name>
              <description>GROUP3_IO1 sampling mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO2</name>
              <description>GROUP3_IO2 sampling mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO3</name>
              <description>GROUP3_IO3 sampling mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO4</name>
              <description>GROUP3_IO4 sampling mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO1</name>
              <description>GROUP4_IO1 sampling mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO2</name>
              <description>GROUP4_IO2 sampling mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO3</name>
              <description>GROUP4_IO3 sampling mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO4</name>
              <description>GROUP4_IO4 sampling mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO1</name>
              <description>GROUP5_IO1 sampling mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO2</name>
              <description>GROUP5_IO2 sampling mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO3</name>
              <description>GROUP5_IO3 sampling mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO4</name>
              <description>GROUP5_IO4 sampling mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO1</name>
              <description>GROUP6_IO1 sampling mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO2</name>
              <description>GROUP6_IO2 sampling mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO3</name>
              <description>GROUP6_IO3 sampling mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO4</name>
              <description>GROUP6_IO4 sampling mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO1</name>
              <description>GROUP7_IO1 sampling mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO2</name>
              <description>GROUP7_IO2 sampling mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO3</name>
              <description>GROUP7_IO3 sampling mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO4</name>
              <description>GROUP7_IO4 sampling mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO1</name>
              <description>GROUP8_IO1 sampling mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO2</name>
              <description>GROUP8_IO2 sampling mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO3</name>
              <description>GROUP8_IO3 sampling mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO4</name>
              <description>GROUP8_IO4 sampling mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCCR</name>
          <description>TSC I/O channel control register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>G1_IO1</name>
              <description>GROUP1_IO1 channel mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO2</name>
              <description>GROUP1_IO2 channel mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO3</name>
              <description>GROUP1_IO3 channel mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1_IO4</name>
              <description>GROUP1_IO4 channel mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO1</name>
              <description>GROUP2_IO1 channel mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO2</name>
              <description>GROUP2_IO2 channel mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO3</name>
              <description>GROUP2_IO3 channel mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2_IO4</name>
              <description>GROUP2_IO4 channel mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO1</name>
              <description>GROUP3_IO1 channel mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO2</name>
              <description>GROUP3_IO2 channel mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO3</name>
              <description>GROUP3_IO3 channel mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3_IO4</name>
              <description>GROUP3_IO4 channel mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO1</name>
              <description>GROUP4_IO1 channel mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO2</name>
              <description>GROUP4_IO2 channel mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO3</name>
              <description>GROUP4_IO3 channel mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4_IO4</name>
              <description>GROUP4_IO4 channel mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO1</name>
              <description>GROUP5_IO1 channel mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO2</name>
              <description>GROUP5_IO2 channel mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO3</name>
              <description>GROUP5_IO3 channel mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5_IO4</name>
              <description>GROUP5_IO4 channel mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO1</name>
              <description>GROUP6_IO1 channel mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO2</name>
              <description>GROUP6_IO2 channel mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO3</name>
              <description>GROUP6_IO3 channel mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G6_IO4</name>
              <description>GROUP6_IO4 channel mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO1</name>
              <description>GROUP7_IO1 channel mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO2</name>
              <description>GROUP7_IO2 channel mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO3</name>
              <description>GROUP7_IO3 channel mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G7_IO4</name>
              <description>GROUP7_IO4 channel mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO1</name>
              <description>GROUP8_IO1 channel mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO2</name>
              <description>GROUP8_IO2 channel mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO3</name>
              <description>GROUP8_IO3 channel mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G8_IO4</name>
              <description>GROUP8_IO4 channel mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
